<template>
  <div class="wrapper">
    <div class="chat">
      <div class="chat__letters letters-chat">
        <div class="letters-chat__body">
          <div class="letters-chat__item">
            <div class="letters-chat__item_grey">
              <img src="./assets/img/all folders-grey.svg" alt="" />
            </div>
            <div class="letters-chat__item_hover">
              <img src="./assets/img/all folders.svg" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_grey">
              <img src="./assets/img/close mail-grey.svg" alt="" />
            </div>
            <div class="letters-chat__item_hover">
              <img src="./assets/img/close mail.svg" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_grey">
              <img src="./assets/img/open mail-grey.svg" alt="" />
            </div>
            <div class="letters-chat__item_hover">
              <img src="./assets/img/open mail.svg" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_s">
              <img src="./assets/img/telega.png" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_s">
              <img src="./assets/img/whatsapp.png" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_s">
              <img src="./assets/img/group_1.png" alt="" />
            </div>
          </div>
          <div class="letters-chat__item">
            <div class="letters-chat__item_s">
              <img src="./assets/img/group_1_копия.png" alt="" />
            </div>
          </div>
        </div>
      </div>
      <div class="chat__container">
        <div class="chat__row">
          <div class="chat__list list-chat">
            <div class="list-chat__header header-list-chat">
              <div class="header-list-chat__title">
                Ваши диалоги <span>(19)</span>
              </div>
              <div class="header-list-chat__icons">
                <div class="header-list-chat__icon">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink"
                    version="1.1"
                    id="Capa_1"
                    x="0px"
                    y="0px"
                    width="24px"
                    height="24px"
                    viewBox="0 0 612 792"
                    enable-background="new 0 0 612 792"
                    xml:space="preserve"
                  >
                    <linearGradient
                      id="SVGID_1_"
                      gradientUnits="userSpaceOnUse"
                      x1="23.294"
                      y1="643.2184"
                      x2="559.7175"
                      y2="193.1057"
                    >
                      <stop offset="0" style="stop-color: #5d2c91" />
                      <stop offset="1" style="stop-color: #d6496f" />
                    </linearGradient>
                    <path
                      fill="url(#SVGID_1_)"
                      d="M588.094,505.05c13.203,0,23.906-10.703,23.906-23.906V281.527c0-19.157-7.46-37.168-21.006-50.713  c-13.545-13.543-31.551-21-50.7-21h-0.013l-260.623-0.005c-9.781-42.4-47.841-74.115-93.164-74.125l-90.867-0.029  c-52.728,0-95.625,42.897-95.625,95.625v349.439c0,0.14-0.002-0.139,0,0l0,0c0,52.728,42.897,95.625,95.625,95.625h420.749  c52.727,0,95.625-42.897,95.625-95.625c0-13.203-10.703-23.906-23.906-23.906s-23.906,10.703-23.906,23.906  c0,26.364-21.449,47.812-47.812,47.812H95.626c-26.364,0-47.812-21.449-47.812-47.811V231.28c0-0.172,0.004,0.171,0,0l0,0  c0-26.364,21.449-47.812,47.804-47.812l90.863,0.029c26.358,0.006,47.802,21.453,47.802,47.812v2.406  c0,13.203,10.703,23.906,23.906,23.906l282.097,0.005c6.384-0.001,12.386,2.484,16.902,6.999c4.515,4.514,7.001,10.518,7.001,16.903  v199.617C564.188,494.347,574.89,505.05,588.094,505.05z M570.472,301.375H130.856c-13.203,0-23.906,10.703-23.906,23.906  s10.703,23.906,23.906,23.906h439.617V301.375z"
                    />
                  </svg>
                </div>
                <div class="header-list-chat__icon">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink"
                    version="1.1"
                    id="Layer_1"
                    x="0px"
                    y="0px"
                    width="18px"
                    height="18px"
                    viewBox="0 0 512 512"
                    enable-background="new 0 0 512 512"
                    xml:space="preserve"
                  >
                    <linearGradient
                      id="SVGID_1_"
                      gradientUnits="userSpaceOnUse"
                      x1="59.8756"
                      y1="420.5679"
                      x2="449.9832"
                      y2="93.2288"
                    >
                      <stop offset="0" style="stop-color: #5d2c91" />
                      <stop offset="1" style="stop-color: #d6496f" />
                    </linearGradient>
                    <path
                      fill="url(#SVGID_1_)"
                      d="M256,0c50.531,0,99.676,15,142.117,43.375c9.184,6.137,11.648,18.559,5.512,27.742  c-6.141,9.184-18.563,11.648-27.742,5.512C340.043,52.664,298.59,40,256,40C136.898,40,40,136.898,40,256s96.898,216,216,216  s216-96.898,216-216c0-39.504-10.758-78.145-31.105-111.738c-5.723-9.445-2.703-21.746,6.746-27.469  c9.445-5.723,21.742-2.703,27.465,6.746C499.242,163.383,512,209.188,512,256c0,68.379-26.629,132.668-74.98,181.02  S324.379,512,256,512s-132.668-26.629-181.02-74.98S0,324.379,0,256S26.629,123.332,74.98,74.98S187.621,0,256,0z M236,366.5  v-90.018h-90c-11.046,0-20-8.954-20-20s8.954-20,20-20h90V145.5c0-11.046,8.954-20,20-20s20,8.954,20,20v90.982h90  c11.046,0,20,8.954,20,20c0,11.046-8.954,20-20,20h-90V366.5c0,11.046-8.954,20-20,20S236,377.546,236,366.5L236,366.5z"
                    />
                  </svg>
                </div>
                <div class="header-list-chat__icon">
                  <svg width="23px" height="23px" viewBox="0 0 612 792">
                    <linearGradient
                      id="SVGID_1_"
                      gradientUnits="userSpaceOnUse"
                      x1="52.8954"
                      y1="719.6017"
                      x2="445.3101"
                      y2="390.3268"
                      gradientTransform="matrix(1.1953 0 0 1.1953 8.2423 -267.3545)"
                    >
                      <stop offset="0" style="stop-color: #5d2c91" />
                      <stop offset="1" style="stop-color: #d6496f" />
                    </linearGradient>
                    <path
                      fill="url(#SVGID_1_)"
                      width="100%"
                      height="100%"
                      d="M306,534.656c-76.456,0-138.656-62.202-138.656-138.656S229.544,257.344,306,257.344  S444.656,319.545,444.656,396c0,13.249-1.871,26.366-5.561,38.984c-3.708,12.673-16.982,19.941-29.657,16.235  c-12.673-3.707-19.941-16.983-16.235-29.656c2.416-8.256,3.64-16.858,3.64-25.563c0-50.092-40.753-90.844-90.844-90.844  S215.156,345.908,215.156,396s40.753,90.844,90.844,90.844c9.38,0,18.615-1.418,27.45-4.215  c12.585-3.984,26.023,2.991,30.006,15.578c3.984,12.588-2.989,26.022-15.577,30.006C334.371,532.489,320.28,534.656,306,534.656z   M389.672,630.281V618.24c0-3.166,1.994-6.036,5.055-7.3l0.467-0.194c3.101-1.286,6.551-0.672,8.79,1.567l8.513,8.513  c13.545,13.547,31.555,21.006,50.714,21.006c19.156,0,37.167-7.46,50.714-21.006l16.904-16.904  c13.545-13.546,21.005-31.556,21.005-50.712c0-19.157-7.46-37.167-21.005-50.712l-8.513-8.513c-2.24-2.24-2.856-5.691-1.568-8.792  l0.18-0.438c1.275-3.087,4.147-5.082,7.313-5.082h12.04c39.546,0,71.719-32.173,71.719-71.719v-23.906  c0-39.546-32.173-71.719-71.719-71.719h-12.04c-3.166,0-6.039-1.995-7.282-5.005l-0.213-0.516c-1.287-3.101-0.673-6.552,1.567-8.792  l8.514-8.513c27.963-27.963,27.963-73.463,0-101.426l-16.904-16.904c-13.546-13.546-31.556-21.006-50.714-21.006  s-37.168,7.46-50.714,21.006l-8.512,8.512c-2.241,2.241-5.696,2.856-8.782,1.573l-0.451-0.186c-3.087-1.274-5.081-4.144-5.081-7.312  v-12.042c0-39.546-32.173-71.719-71.719-71.719h-23.906c-39.546,0-71.719,32.173-71.719,71.719v12.042  c0,3.166-1.994,6.036-5.055,7.3l-0.467,0.194c-3.098,1.289-6.552,0.673-8.79-1.567l-8.513-8.513  c-13.545-13.546-31.555-21.006-50.714-21.006c-19.156,0-37.167,7.46-50.714,21.006l-16.902,16.904  c-27.963,27.963-27.963,73.463,0.001,101.427l8.512,8.512c2.24,2.241,2.856,5.692,1.531,8.881l-0.145,0.349  c-1.274,3.087-4.147,5.082-7.313,5.082h-12.04C32.173,312.329,0,344.502,0,384.048v23.906c0,39.546,32.173,71.719,71.719,71.719  h12.04c3.166,0,6.038,1.995,7.282,5.005l0.213,0.516c1.287,3.101,0.673,6.551-1.568,8.792l-8.512,8.513  c-13.546,13.546-21.006,31.556-21.006,50.714c0,19.156,7.46,37.167,21.005,50.712l16.904,16.904  c13.546,13.546,31.556,21.006,50.714,21.006s37.168-7.46,50.714-21.006l8.512-8.512c2.239-2.241,5.694-2.856,8.782-1.573  l0.451,0.186c3.087,1.274,5.081,4.144,5.081,7.312v12.039c0,39.546,32.173,71.719,71.719,71.719h23.906  C357.499,702,389.672,669.827,389.672,630.281z M174.206,578.505l-8.513,8.514c-4.515,4.515-10.518,7.001-16.904,7.001  c-6.385,0-12.388-2.487-16.904-7.002l-16.904-16.904c-4.516-4.516-7.002-10.519-7.002-16.904s2.486-12.389,7.002-16.904l8.513-8.513  c15.969-15.971,20.648-39.878,11.924-60.914l-0.155-0.375c-8.69-21.046-28.906-34.644-51.504-34.644h-12.04  c-13.182,0-23.906-10.724-23.906-23.906v-23.906c0-13.182,10.724-23.906,23.906-23.906h12.04c22.596,0,42.813-13.598,51.537-34.721  l0.111-0.271c8.741-21.042,4.064-44.963-11.914-60.942l-8.512-8.512c-9.322-9.321-9.322-24.487,0-33.809l16.903-16.904  c4.516-4.515,10.52-7.002,16.905-7.002c6.387,0,12.388,2.486,16.904,7.002l8.514,8.514c15.98,15.978,39.902,20.653,60.95,11.908  l0.337-0.14c21.046-8.689,34.645-28.905,34.645-51.502v-12.042c0-13.182,10.724-23.906,23.906-23.906h23.906  c13.182,0,23.906,10.724,23.906,23.906v12.042c0,22.597,13.599,42.814,34.671,51.516l0.323,0.134  c21.04,8.738,44.961,4.062,60.941-11.914l8.513-8.514c4.515-4.515,10.518-7.001,16.904-7.001c6.385,0,12.388,2.487,16.904,7.002  l16.904,16.904c9.322,9.321,9.322,24.487,0.001,33.808l-8.514,8.514c-15.977,15.978-20.653,39.898-11.948,60.853l0.179,0.436  c8.69,21.043,28.906,34.641,51.504,34.641h12.04c13.182,0,23.906,10.724,23.906,23.906v23.906c0,13.182-10.724,23.906-23.906,23.906  h-12.04c-22.596,0-42.813,13.598-51.505,34.644l-0.155,0.375c-8.725,21.036-4.046,44.944,11.924,60.914l8.514,8.513  c4.515,4.515,7.001,10.519,7.001,16.904s-2.486,12.388-7.002,16.904l-16.903,16.904c-4.516,4.515-10.52,7.002-16.905,7.002  c-6.387,0-12.388-2.486-16.904-7.002l-8.514-8.514c-15.979-15.975-39.901-20.65-60.95-11.908l-0.337,0.14  c-21.046,8.69-34.645,28.906-34.645,51.504v12.042c0,13.182-10.724,23.906-23.906,23.906h-23.906  c-13.182,0-23.906-10.724-23.906-23.906V618.24c0-22.597-13.599-42.814-34.671-51.516l-0.323-0.134  c-7.04-2.924-14.4-4.346-21.679-4.346C198.992,562.245,184.84,567.874,174.206,578.505z"
                    />
                  </svg>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat active">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon icon">A</div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger wp"> WhatsApp </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text item-list-chat__text_new">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon item-list-chat__icon_new icon">
                  A
                </div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger tg"> Telegram </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon icon">A</div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger tg"> Telegram </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon icon">A</div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger tg"> Telegram </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon icon">A</div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger tg"> Telegram </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
            <div class="list-chat__item item-list-chat">
              <div class="item-list-chat__body">
                <div class="item-list-chat__icon icon">A</div>
                <div class="item-list-chat__block">
                  <div class="item-list-chat__line line">
                    <span class="line__name"> Andrey </span>
                    <div class="line__number">
                      79007389606
                      <span class="line__messenger tg"> Telegram </span>
                    </div>
                  </div>
                  <div class="item-list-chat__text">
                    Хочу заказать расчет...
                  </div>
                  <div class="item-list-chat__date">12 июня, 18:33</div>
                </div>
              </div>
            </div>
          </div>
          <div class="chat__item chat-item">
            <div class="chat-item__header header-item-chat">
              <div class="header-item-chat__body">
                <span class="header-item-chat__line line">
                  <span class="line__name"> Andrey </span>
                  <div class="line__number">
                    79007389606
                    <span class="line__messenger tg"> Telegram </span>
                  </div>
                </span>
                <span class="header-item-chat__info">
                  <img src="./assets/img/info.png" alt="" />
                </span>
              </div>
              <div class="header-item-chat__exit">
                <span class="header-item-chat__exit_text">
                  Выход из диалога
                </span>
                <span class="header-item-chat__exit_icon">
                  <svg width="22px" height="19px" viewBox="0 0 512 512">
                    <linearGradient
                      id="SVGID_1_"
                      gradientUnits="userSpaceOnUse"
                      x1="-19.4643"
                      y1="70.8286"
                      x2="375.6626"
                      y2="402.3794"
                      gradientTransform="matrix(1 0 0 -1 8.84 488.04)"
                    >
                      <stop offset="0" style="stop-color: #5d2c91" />
                      <stop offset="1" style="stop-color: #d6496f" />
                    </linearGradient>
                    <path
                      fill="url(#SVGID_1_)"
                      d="M362,362v40c0,44.113-35.887,80-80,80H81c-44.113,0-80-35.887-80-80V110c0-44.113,35.887-80,80-80  h201c44.113,0,80,35.887,80,80v40c0,11.047-8.953,20-20,20s-20-8.953-20-20v-40c0-22.055-17.945-40-40-40H81  c-22.055,0-40,17.945-40,40v292c0,22.055,17.945,40,40,40h201c22.055,0,40-17.945,40-40v-40c0-11.047,8.953-20,20-20  S362,350.953,362,362z M498.355,221.645l-44.785-44.785c-7.813-7.813-20.477-7.813-28.285,0c-7.813,7.809-7.813,20.473,0,28.281  L457.141,237H217c-11.047,0-20,8.953-20,20s8.953,20,20,20h240.141l-31.855,31.859c-7.813,7.809-7.813,20.473,0,28.281  c3.906,3.906,9.023,5.859,14.141,5.859c5.121,0,10.238-1.953,14.145-5.859l44.785-44.785  C517.852,272.859,517.852,241.141,498.355,221.645z"
                    />
                  </svg>
                </span>
              </div>
            </div>
            <div class="chat-item__content content-chat-content">
              <div class="content-chat-content__message sender">
                <div class="content-chat-content__message_container">
                  <div class="content-chat-content__icon icon">A</div>
                  <div class="content-chat-content__block">
                    <div class="content-chat-content__line">
                      <div class="content-chat-content__name">Andrey</div>
                      <div class="content-chat-content__date">
                        12 июня, 18:26
                      </div>
                    </div>
                    <div class="content-chat-content__item">
                      <span>
                        Привет,я Валерa!!! Хочу заказать аниматора на детский
                        праздник</span
                      >
                    </div>
                  </div>
                </div>
              </div>
              <div class="content-chat-content__message recipient">
                <div class="content-chat-content__message_container">
                  <div class="content-chat-content__icon icon">A</div>
                  <div class="content-chat-content__block">
                    <div class="content-chat-content__line">
                      <div class="content-chat-content__name">Andrey</div>
                      <div class="content-chat-content__date checked">
                        12 июня, 18:26
                      </div>
                    </div>
                    <div class="content-chat-content__item">
                      Привет,а я Валерa!!!
                    </div>
                  </div>
                </div>
              </div>
            </div>
            <div class="chat-item__footer footer-chat-item">
              <div class="footer-chat-item__body">
                <form action="">
                  <div class="footer-chat-item__input">
                    <textarea name="" id=""></textarea>
                  </div>
                  <div class="footer-chat-item__icons">
                    <button class="footer-chat-item__button active">
                      <svg width="22px" height="19px" viewBox="0 0 512 512">
                        <linearGradient
                          id="SVGID_1_"
                          gradientUnits="userSpaceOnUse"
                          x1="61.866"
                          y1="318.2997"
                          x2="444.3639"
                          y2="-2.6542"
                        >
                          <stop offset="0" style="stop-color: #5d2c91" />
                          <stop offset="1" style="stop-color: #d6496f" />
                        </linearGradient>
                        <path
                          fill="url(#SVGID_1_)"
                          d="M506.015,73.272c-9.581-19.192-28.862-31.18-50.418-31.285H55.854c-0.115,0-0.231,0.001-0.346,0.003  C31.31,42.409,10.705,57.485,3.013,80.397C0.984,86.44,0.001,92.589,0.001,98.644c0.001,16.916,7.681,33.089,21.714,44.095  c0.222,0.175,0.449,0.344,0.679,0.51l136.643,98.089v172.83c0,0.132,0.002,0.263,0.004,0.395  c0.476,24.126,15.668,44.697,38.702,52.407c23.097,7.731,47.68,0.429,62.628-18.604c0.065-0.082,0.129-0.166,0.192-0.249  l34.153-44.925c6.686-8.794,4.975-21.341-3.817-28.025c-8.793-6.685-21.34-4.976-28.025,3.817l-34.043,44.781  c-6.664,8.371-15.755,6.155-18.391,5.273c-2.609-0.874-11.108-4.536-11.403-15.103v-182.86c0-6.443-3.103-12.491-8.337-16.248  L46.122,111.044c-8.163-6.631-6.042-15.373-5.189-17.916c0.858-2.556,4.477-10.882,15.123-11.14h383.105l-180.81,92.138  c-9.843,5.016-13.755,17.059-8.739,26.9c5.015,9.842,17.058,13.754,26.9,8.739l187.733-95.666l-135.99,178.883  c-6.686,8.795-4.976,21.341,3.817,28.025c8.793,6.685,21.34,4.976,28.025-3.817l140.596-184.942  c0.041-0.054,0.082-0.108,0.122-0.162C513.575,114.943,515.568,92.406,506.015,73.272z"
                        />
                      </svg>
                    </button>
                    <button class="footer-chat-item__button">
                      <svg width="25px" height="23px" viewBox="0 0 612 792">
                        <linearGradient
                          id="SVGID_1_"
                          gradientUnits="userSpaceOnUse"
                          x1="17.9153"
                          y1="731.9166"
                          x2="475.7896"
                          y2="347.7145"
                          gradientTransform="matrix(1.195 0 0 1.195 8.2229 -267.3313)"
                        >
                          <stop offset="0" style="stop-color: #5d2c91" />
                          <stop offset="1" style="stop-color: #d6496f" />
                        </linearGradient>
                        <path
                          fill="url(#SVGID_1_)"
                          d="M611.98,230.615c-0.552,27.731-12.409,54.677-33.383,75.872c-9.283,9.38-24.413,9.461-33.797,0.177  c-9.381-9.284-9.46-24.415-0.176-33.797c21.739-21.969,30.035-57.93-0.442-88.745c-25.711-25.996-59.141-26.513-85.232-1.342  L185.926,460.362c-4.245,4.289-12.638,15.516-0.059,28.237c4.334,4.382,8.927,6.603,13.649,6.602c4.8,0,9.755-2.34,13.956-6.591  l188.864-192.949c9.233-9.432,24.365-9.594,33.796-0.361c9.432,9.233,9.594,24.363,0.362,33.796L247.548,522.129  c-13.329,13.484-30.356,20.867-48.024,20.869h-0.008c-17.456,0-34.371-7.382-47.631-20.789  c-27.344-27.648-27.336-67.775,0.017-95.416l273.374-277.938l0.198-0.192c21.059-20.442,47.497-31.892,74.442-32.241  c0.441-0.005,0.882-0.008,1.322-0.008c28.273,0,54.846,11.771,76.927,34.097C600.548,173.145,612.557,201.592,611.98,230.615z   M503.107,350.178c-9.48-9.18-24.611-8.937-33.793,0.545L233.429,594.345c-21.354,21.563-48.371,33.44-76.089,33.444h-0.014  c-27.707,0-53.995-11.769-76.015-34.033c-51.543-52.114-37.153-113.32-0.014-150.883l235.524-235.472  c9.334-9.332,9.335-24.463,0.004-33.797c-9.331-9.334-24.462-9.335-33.797-0.004L47.457,409.117l-0.09,0.091  C17.827,439.06,1.023,476.7,0.047,515.198c-1.041,41.053,15.31,79.84,47.282,112.168c30.754,31.096,69.816,48.221,109.997,48.22  h0.022c40.621-0.006,79.743-16.954,110.156-47.723l236.148-243.892C512.833,374.488,512.589,359.359,503.107,350.178z"
                        />
                      </svg>
                    </button>
                    <button class="footer-chat-item__button">
                      <svg width="20px" height="24px" viewBox="0 0 612 792">
                        <linearGradient
                          id="SVGID_1_"
                          gradientUnits="userSpaceOnUse"
                          x1="83.6335"
                          y1="719.0267"
                          x2="412.1547"
                          y2="443.3647"
                          gradientTransform="matrix(1.1953 0 0 1.1953 8.2423 -267.3545)"
                        >
                          <stop offset="0" style="stop-color: #5d2c91" />
                          <stop offset="1" style="stop-color: #d6496f" />
                        </linearGradient>
                        <path
                          fill="url(#SVGID_1_)"
                          d="M180.492,396V225.508C180.492,156.303,236.795,100,306,100s125.508,56.303,125.508,125.508v60.961  c0,13.203-10.703,23.906-23.906,23.906s-23.906-10.703-23.906-23.906v-60.961c0-42.841-34.854-77.695-77.695-77.695  s-77.695,34.854-77.695,77.695V396c0,42.841,34.854,77.695,77.695,77.695s77.695-34.854,77.695-77.695  c0-13.203,10.703-23.906,23.906-23.906s23.906,10.703,23.906,23.906c0,69.205-56.303,125.508-125.508,125.508  S180.492,465.205,180.492,396z M527.133,396c0-13.203-10.703-23.906-23.906-23.906c-13.203,0-23.906,10.703-23.906,23.906  c0,95.569-77.751,173.32-173.32,173.32S132.68,491.569,132.68,396c0-13.203-10.703-23.906-23.906-23.906S84.867,382.797,84.867,396  c0,113.857,86.494,207.892,197.227,219.849v38.338H211.57c-13.203,0-23.906,10.703-23.906,23.906S198.367,702,211.57,702h191.25  c13.203,0,23.906-10.703,23.906-23.906s-10.703-23.906-23.906-23.906h-72.914v-38.338C440.639,603.892,527.133,509.857,527.133,396z  "
                        />
                      </svg>
                    </button>
                    <button class="footer-chat-item__button">
                      <svg
                        x="0px"
                        y="0px"
                        width="23.5px"
                        height="23.5px"
                        viewBox="0 0 612 792"
                      >
                        <linearGradient
                          id="SVGID_1_"
                          gradientUnits="userSpaceOnUse"
                          x1="52.0817"
                          y1="718.4611"
                          x2="444.3311"
                          y2="389.3248"
                          gradientTransform="matrix(1.1953 0 0 1.1953 8.2423 -267.3545)"
                        >
                          <stop offset="0" style="stop-color: #5d2c91" />
                          <stop offset="1" style="stop-color: #d6496f" />
                        </linearGradient>
                        <path
                          fill="url(#SVGID_1_)"
                          d="M306,702c-81.735,0-158.579-31.83-216.375-89.625C31.83,554.578,0,477.735,0,396  s31.83-158.579,89.625-216.375C147.421,121.83,224.265,90,306,90s158.579,31.83,216.375,89.625C580.17,237.421,612,314.265,612,396  c0,60.399-17.927,119.142-51.845,169.873c-7.337,10.975-22.183,13.924-33.16,6.586c-10.975-7.338-13.924-22.185-6.586-33.16  c28.641-42.84,43.78-92.392,43.78-143.299c0-142.365-115.822-258.188-258.188-258.188S47.813,253.635,47.813,396  S163.635,654.188,306,654.188c47.221,0,93.406-12.857,133.561-37.181c11.291-6.842,25.992-3.233,32.834,8.061  c6.841,11.292,3.231,25.992-8.061,32.834C416.706,686.75,361.956,702,306,702z M449.438,458.156  c0-13.203-10.703-23.906-23.906-23.906H186.469c-13.203,0-23.906,10.703-23.906,23.906c0,79.091,64.346,143.438,143.438,143.438  S449.438,537.248,449.438,458.156z M398.6,482.063c-10.641,41.198-48.123,71.719-92.6,71.719s-81.958-30.521-92.6-71.719H398.6z   M478.125,348.188c0-13.203-10.703-23.906-23.906-23.906h-46.331l13.234-23.75c6.427-11.532,2.287-26.092-9.246-32.52  c-11.536-6.43-26.095-2.287-32.52,9.246l-33.041,59.292c-4.125,7.404-4.022,16.439,0.271,23.747  c4.295,7.307,12.136,11.795,20.612,11.795h87.02C467.422,372.094,478.125,361.391,478.125,348.188z M260.87,360.298  c4.294-7.308,4.396-16.344,0.271-23.747L228.1,277.259c-6.427-11.534-20.986-15.672-32.52-9.246  c-11.532,6.427-15.673,20.987-9.246,32.52l13.234,23.748h-46.332c-13.203,0-23.906,10.703-23.906,23.906  s10.703,23.906,23.906,23.906h87.02C248.734,372.094,256.575,367.605,260.87,360.298z"
                        />
                      </svg>
                    </button>
                    <button class="footer-chat-item__button">
                      <svg width="23.5px" height="23.5px" viewBox="0 0 612 792">
                        <linearGradient
                          id="SVGID_1_"
                          gradientUnits="userSpaceOnUse"
                          x1="70.4963"
                          y1="591.431"
                          x2="539.3568"
                          y2="198.0104"
                        >
                          <stop offset="0" style="stop-color: #5d2c91" />
                          <stop offset="1" style="stop-color: #d6496f" />
                        </linearGradient>
                        <path
                          fill="url(#SVGID_1_)"
                          d="M306,702c-81.735,0-158.579-31.83-216.375-89.625C31.83,554.578,0,477.735,0,396  s31.83-158.579,89.625-216.375C147.421,121.83,224.265,90,306,90s158.579,31.83,216.375,89.625C580.17,237.421,612,314.265,612,396  c0,60.399-17.927,119.142-51.845,169.873c-7.337,10.975-22.183,13.924-33.16,6.586c-10.975-7.338-13.924-22.185-6.586-33.16  c28.641-42.84,43.78-92.392,43.78-143.299c0-142.365-115.822-258.188-258.188-258.188S47.813,253.635,47.813,396  S163.635,654.188,306,654.188c47.221,0,93.406-12.857,133.561-37.181c11.291-6.842,25.992-3.233,32.834,8.061  c6.841,11.292,3.231,25.992-8.061,32.834C416.706,686.75,361.956,702,306,702z M306,361c-19.33,0-35,15.67-35,35s15.67,35,35,35  s35-15.67,35-35S325.33,361,306,361z M192,361c-19.33,0-35,15.67-35,35s15.67,35,35,35s35-15.67,35-35S211.33,361,192,361z M420,361  c-19.33,0-35,15.67-35,35s15.67,35,35,35s35-15.67,35-35S439.33,361,420,361z"
                        />
                      </svg>
                    </button>
                  </div>
                </form>
                <div class="footer-chat-item__templates">
                  <div class="footer-chat-item__templates_icon">
                    <svg width="23.5px" height="23.5px" viewBox="0 0 612 792">
                      <linearGradient
                        id="SVGID_1_"
                        gradientUnits="userSpaceOnUse"
                        x1="7.4748"
                        y1="758.6858"
                        x2="489.0609"
                        y2="354.5871"
                        gradientTransform="matrix(1.1953 0 0 1.1953 8.2423 -267.3545)"
                      >
                        <stop offset="0" style="stop-color: #5d2c91" />
                        <stop offset="1" style="stop-color: #d6496f" />
                      </linearGradient>
                      <path
                        fill="url(#SVGID_1_)"
                        d="M512.328,293.031H323.906c-46.137,0-83.672-37.535-83.672-83.672v-18.688  c0-46.137,37.535-83.672,83.672-83.672h188.422C558.465,107,596,144.535,596,190.672v18.688  C596,255.496,558.465,293.031,512.328,293.031z M323.906,154.813c-19.773,0-35.859,16.087-35.859,35.859v18.688  c0,19.773,16.087,35.859,35.859,35.859h188.422c19.773,0,35.859-16.087,35.859-35.859v-18.688c0-19.773-16.087-35.859-35.859-35.859  H323.906z M596,605.328c0-13.203-10.703-23.906-23.906-23.906s-23.906,10.703-23.906,23.906c0,19.773-16.087,35.859-35.859,35.859  H323.906c-19.773,0-35.859-16.087-35.859-35.859V418.102c0-19.773,16.087-35.859,35.859-35.859h188.422  c19.773,0,35.859,16.087,35.859,35.859v67.695c0,13.203,10.703,23.906,23.906,23.906S596,499,596,485.797v-67.695  c0-46.137-37.535-83.672-83.672-83.672H323.906c-46.137,0-83.672,37.535-83.672,83.672v187.227  c0,46.137,37.535,83.672,83.672,83.672h188.422C558.465,689,596,651.465,596,605.328z M116.359,689H97.672  C51.535,689,14,651.465,14,605.328V190.672C14,144.535,51.535,107,97.672,107h18.688c46.137,0,83.672,37.535,83.672,83.672v414.656  C200.031,651.465,162.496,689,116.359,689z M97.672,154.813c-19.773,0-35.859,16.087-35.859,35.859v414.656  c0,19.773,16.087,35.859,35.859,35.859h18.688c19.773,0,35.859-16.087,35.859-35.859V190.672c0-19.773-16.087-35.859-35.859-35.859  H97.672z"
                      />
                    </svg>
                  </div>
                  <div class="footer-chat-item__templates_text">Шаблоны</div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
